load-test.yaml
config:
  target:  'wss://next-client-check.com/'  # URL вашего WebSocket сервера
  phases:
    - duration: 60  # Первая фаза — 60 секунд
      arrivalRate: 83  # Открываем 167 соединений в секунду
      rampTo: 83  # Достигнем 10,000 подключений за 1 минуту (167 * 60 = 10,000)
    - duration: 60  # Вторая фаза — поддерживаем подключение еще 5 минут
      arrivalRate: 0  # Новые подключения не открываются, удерживаем текущее количество
  engines:
    ws:
      pingInterval: 10000  # Интервал пинга в миллисекундах (каждые 10 секунд)

scenarios:
  - engine: "ws"
    flow:
      - send:
          text: '{"action": "start", "data": "DD_IDOT"}'  # Отправка стартового сообщения
      - think: 60  # Ждем 60 секунд
      - send:
          text: '{"action": "ping"}'  # Отправляем пинг каждую минуту
      - think: 60  # Ждем следующую минуту перед отправкой следующего пинга