load-test.yaml
#config:
#  target:  'wss://next-client-check.com/'  # URL вашего WebSocket сервера
#  phases:
#    - duration: 60  # Первая фаза — 60 секунд
#      arrivalRate: 100  # Открываем 167 соединений в секунду
#      rampTo: 100  # Достигнем 10,000 подключений за 1 минуту (167 * 60 = 10,000)
#    - duration: 60  # Вторая фаза — поддерживаем подключение еще 5 минут
#      arrivalRate: 0  # Новые подключения не открываются, удерживаем текущее количество
#  engines:
#    ws:
#      pingInterval: 10000  # Интервал пинга в миллисекундах (каждые 10 секунд)
#
#scenarios:
#  - engine: "ws"
#    flow:
#      - send:
#          text: '{"action": "start", "data": "DD_IDOT"}'  # Отправка стартового сообщения
#      - think: 60  # Ждем 60 секунд
#      - send:
#          text: '{"action": "ping"}'  # Отправляем пинг каждую минуту
#      - think: 60  # Ждем следующую минуту перед отправкой следующего пинга

config:
  target: "wss://next-client-check.com/"  # Your application URL or API endpoint
  phases:
    - duration: 30               # Ramp-up time (30 seconds)
      arrivalRate: 2000           # Number of new virtual users (VUs) per second
      rampTo: 2000                # Gradually reach 2,000 users per second, which in 30 seconds totals 60,000 users
      name: "Ramp up to 60k users"
    - duration: 180               # Hold traffic for 3 minutes (180 seconds)
      arrivalRate: 2000           # Hold at 2,000 users per second
      name: "Sustain high traffic for 3 minutes"